/*
    Quiz 3

    題目敘述: 
    寫一個程式來玩賓果。一個賓果盤面共有 m 欄及 m 列；每個格子中都會有一個 1 至 m * m 間不重複的數字。遊戲過程中，1 至 m * m 間的數字會隨機被喊到。若一個玩家在他賓果盤面中任何一欄、一列、一斜對角中的所有數字都被喊過，該玩家就贏了該場遊戲。現在給定 n 個玩家以及他們的賓果盤面，計算誰贏了遊戲。

    輸入格式: 
    第一行包含數字 n 及 m。接下來 m 行為編號 0 號玩家的賓果盤面，每行皆有 m 組數字。接下來的 m 行為編號 1 號玩家的賓果盤面，以此類推。最後一行將會有 m * m 個數字，代表賓果遊戲進行中數字被喊到的順序。

    輸出格式: 
    輸出哪個喊到的數字讓玩家獲勝，並輸出獲勝的玩家編號。若有多名玩家同時獲勝，從小至大輸出所有獲勝玩家的編號。

    輸入限制:
    n 是一個正整數且不大於 10。
    m 是一個正整數且不大於 256。
    
    輸入範例:
    2 3
    1 2 3
    4 5 6
    7 8 9
    1 2 3
    4 5 6
    7 8 9
    1 2 4 8 6 3 9 5 7

    輸出範例: 
    3 0 1
*/

/*
    Pseudo code:
    1. read players n and matrix dimemntion m, 0 <= n < 10 & 0 <= m < 256
    2. generate and read the matrix for each user
    3. read the guess numbers 
    4. iterate the guess number and check the winner
        a. mark the guess number with CHECKED = -1
        b. start to check winner from the m guess number
        c. check the row, column and diagonal checked 
        d. if got winner(s), stop the iteration
    5. print output with the iterate number and the winner(s)
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define TRUE        1
#define FALSE       0
#define CHECKED     -1

int main (void)
{

    // read the players and szie of matrix
    int players = 0, matrixSize = 0;
    scanf("%d %d", &players, &matrixSize);
    if (players <= 0 || players > 10 || matrixSize <= 0 || matrixSize > 256)
    {
        printf("0 < Players < 10; 0 < matrix size < 256\n");
        exit(0);
    }

    // print number of players and matrix size
    // printf ("Players = %d, matrix size = %d \n", players, matrixSize);

    // generate matrix for each player and read in their numbers
    int player[players][matrixSize][matrixSize];

    for (int pNum = 0; pNum < players; pNum++)
    {
        int element = 0; 
        for (int row = 0; row < matrixSize; row++)
            for (int col = 0; col < matrixSize; col++)
            {
                scanf("%d", &element);
                player[pNum][row][col] = element;
            }
    }


    // read the guess numger
    int guess[matrixSize * matrixSize];
    int guestNum = 0;
    for (int cnt = 0, max = matrixSize * matrixSize; cnt < max; cnt++)
    {
        scanf("%d", &guestNum);
        guess[cnt] = guestNum;
    }


    // // testing
    // int players = 2, matrixSize = 3;
    // int player[players][matrixSize][matrixSize];

    // for (int pNum = 0; pNum < players; pNum++)
    //     for (int row = 0; row < matrixSize; row++)
    //         for (int col = 0; col < matrixSize; col++)
    //         {
    //             player[pNum][row][col] = row * 3 + col + 1;
    //         }

    // int guess[9] = {1, 2, 4, 8, 6, 3, 9, 5, 7};


    // find the match
    int matchNum = 0;
    int matched[players];
    for (int i = 0; i < players; i++)
        matched[i] = FALSE;

    for (int cnt = 0; cnt < matrixSize * matrixSize; cnt++)
    {
        // mark the guest number
        for (int pNum = 0; pNum < players; pNum++)
        {
            for (int row = 0; row < matrixSize; row++)
            {
                for (int col = 0; col < matrixSize; col++)
                {
                    if (player[pNum][row][col] == guess[cnt])
                    {
                        player[pNum][row][col] = CHECKED;
                    }
                }
            }
        }

        // // print the marked matrix
        // printf("\n");
        // printf("cnt = %d  guess = %d\n", cnt, guess[cnt]);
        // for (int pNum = 0; pNum < players; pNum++)
        // {
        //     printf("Player %d:\n", pNum);
        //     for (int row = 0; row < matrixSize; row++)
        //     {
        //         for (int col = 0; col < matrixSize; col++)
        //         {
        //             printf("%3d ", player[pNum][row][col]);
        //         }
        //         printf("\n");
        //     }
        // }

        // ignore the first n-1 guess numbers
        if (cnt < matrixSize - 1)
        {
            continue;
        }
        else
        {
            // check for row, column, and diagnoal 
            for (int pNum = 0; pNum < players; pNum++)
            {
                // check row
                for (int row = 0; row < matrixSize; row++)
                {
                    int match = FALSE;
                    for (int col = 0; col < matrixSize; col++)
                    {
                        if (player[pNum][row][col] == CHECKED && col == 0)
                        {
                            match = TRUE;
                        }
                        else if (player[pNum][row][col] != CHECKED)
                        {
                            match = FALSE;
                        }
                    }
                    if (match == TRUE && matched[pNum] == FALSE)
                    {
                        matched[pNum] = TRUE;
                        matchNum = cnt;
                        // printf("matched[%d] = %d\n", pNum, matched[pNum]);
                    }

                    if (matched[pNum] == TRUE)
                    {
                        continue;
                    }
                }

                // check column
                for (int col = 0; col < matrixSize; col++)
                {
                    int match = FALSE;
                    for (int row = 0; row < matrixSize; row++)
                    {
                        if (player[pNum][row][col] == CHECKED && row == 0)
                        {
                            match = TRUE;
                        }
                        else if (player[pNum][row][col] != CHECKED)
                        {
                            match = FALSE;
                        }
                    }
                    if (match == TRUE && matched[pNum] == FALSE)
                    {
                        matched[pNum] = TRUE;
                        matchNum = cnt;
                    }

                    if (matched[pNum] == TRUE)
                    {
                        continue;
                    }
                }

                // check diagonal
                int fmatch = FALSE, bmatch = FALSE;                
                for (int idx = 0; idx  < matrixSize; idx++)
                {
                    // check the forward and backward diagnoal
                    if (player[pNum][idx][idx] == CHECKED && idx == 0)
                    {
                        fmatch = TRUE;
                    }
                    else if (player[pNum][idx][idx] != CHECKED)
                    {
                        fmatch = FALSE;
                    }

                    // check the forward and backward diagnoal
                    if (player[pNum][idx][matrixSize - idx - 1] == CHECKED \
                        && idx == 0)
                    {
                        bmatch = TRUE;
                    }
                    else if (player[pNum][idx][matrixSize - idx - 1] \
                        != CHECKED)
                    {
                        bmatch = FALSE;
                    }
                }
                if ((fmatch == TRUE || bmatch == TRUE) && \
                    matched[pNum] == FALSE)
                {
                    matched[pNum] = TRUE;
                    matchNum = cnt;
                }

                if (matched[pNum] == TRUE)
                {
                    continue;
                }                
            }

        }

        // break the loop as matched
        int loopbreak = FALSE;
        for (int pNum = 0; pNum < players; pNum++)
        {
            if (matched[pNum] == TRUE)
            {
                loopbreak = TRUE;
            }
        }

        if (loopbreak == TRUE)
        {
            break;
        }
    }

    // print results
    printf("Output: ");
    printf("%d ", guess[matchNum]);

    for (int pNum = 0; pNum < players; pNum++)
    {
        if (matched[pNum] == TRUE)
        {
            printf("%d ", pNum);
        }
    }
    printf("\n");
    return 0;
}


/* 
1.  Input:
    4 4
    1 2 3 4
    5 6 7 8
    9 10 11 12
    13 14 15 16
    1 13 7 15
    4 16 9 2
    8 10 6 12
    5 14 3 11
    9 10 3 2
    5 7 16 1
    13 12 14 11
    4 8 15 6
    5 13 4 10
    11 6 16 1
    12 2 7 14
    3 15 8 9
    16 9 11 15 14 6 1 10 2 8 12 3 7 5 13 4

    Output: 1 0 1 3

2.  Input:
    10 3
    6 9 8
    5 3 2
    1 7 4
    9 5 2
    7 1 6
    3 4 8
    6 5 3
    7 8 1
    4 2 9
    3 2 8
    7 6 1
    4 5 9
    5 9 2
    4 8 7
    1 3 6
    3 9 2
    4 8 5
    6 7 1
    5 6 3
    1 4 2
    8 9 7
    9 6 2
    1 3 7
    4 5 8
    7 5 1
    8 2 9
    4 3 6
    9 5 1
    6 7 3
    2 8 4
    2 4 5 1 9 6 3 7 8

    Output: 1 1 4 5 6 8

3.  Input:
    4 8
    61 17 29 6 49 55 28 45
    7 32 26 27 16 53 50 44
    20 46 31 5 57 39 62 15
    54 40 42 25 11 10 23 4
    2 12 38 9 36 59 37 48
    14 63 1 58 33 52 51 35
    19 24 18 22 8 47 30 56
    43 3 41 60 34 64 21 13
    16 53 21 51 56 46 4 41
    44 64 30 10 45 37 8 57
    50 2 52 26 38 49 27 9
    1 62 11 25 6 23 55 36
    31 58 42 34 48 7 47 39
    17 54 61 22 18 63 12 29
    59 33 60 19 20 43 40 14
    24 28 5 3 32 15 35 13
    41 4 30 50 56 17 16 25
    29 20 6 23 64 54 14 22
    31 43 7 24 32 1 9 60
    63 37 19 40 57 59 55 5
    10 38 48 61 51 39 12 53
    58 36 2 35 49 62 15 21
    47 28 46 34 33 44 45 8
    11 3 18 26 13 27 42 52
    9 43 51 57 12 58 13 46
    44 18 33 23 35 25 26 4
    8 29 24 54 6 10 17 34
    48 60 39 2 5 62 21 7
    63 55 40 37 14 15 49 64
    53 59 28 45 47 42 11 3
    22 41 16 56 1 52 20 32
    38 31 19 50 27 61 36 30
    47 56 32 59 64 21 33 57 60 25 30 14 3 1 8 49 42 27 11 35 26 2 46 7 23 39 51 16 63 19 4 45 62 53 5 55 22 15 18 6 29 61 28 10 17 52 54 31 12 37 41 50 20 43 48 9 58 34 38 13 40 44 36 24

    Output: 28 2 3

4.  Input:
    3 10
    45 32 72 48 65 63 73 92 99 64
    12 36 82 14 21 3 68 41 4 25
    83 38 57 53 81 89 16 34 2 46
    75 54 69 19 43 13 40 24 60 77
    70 49 95 71 50 28 59 33 98 100
    80 93 90 11 61 20 26 22 88 31
    8 27 91 79 52 86 66 42 62 84
    15 55 74 78 67 35 97 47 1 96
    94 44 7 18 39 58 5 29 23 56
    10 9 76 6 37 85 17 87 30 51
    1 45 50 49 16 20 83 19 12 46
    55 42 18 99 76 92 26 94 41 75
    87 2 3 30 34 39 97 90 11 47
    59 67 21 28 70 35 93 63 17 71
    38 52 57 73 85 86 23 31 33 7
    13 54 6 84 37 51 74 66 40 96
    81 58 10 15 43 27 95 62 36 65
    56 77 82 100 68 9 53 91 22 5
    72 78 69 24 25 88 98 8 29 32
    4 48 14 89 80 64 60 79 61 44
    29 15 88 47 9 83 63 53 33 22
    31 44 62 100 41 5 79 14 70 25
    96 80 32 67 89 82 3 81 98 13
    20 43 37 85 34 49 19 76 46 91
    2 24 16 11 26 94 4 7 10 61
    93 12 78 97 39 54 64 87 51 68
    58 40 69 55 45 50 60 92 1 99
    72 28 77 18 59 48 65 57 27 36
    52 86 42 73 56 75 23 95 74 8
    21 84 38 90 71 17 35 30 66 6
    59 94 16 27 68 58 79 38 17 84 21 57 5 22 73 95 2 30 64 14 49 1 87 41 29 46 96 35 54 48 85 31 42 93 3 8 88 6 37 86 18 45 75 63 24 55 47 36 97 13 23 92 78 91 40 80 32 52 39 66 12 81 34 82 67 56 33 50 4 90 62 74 51 25 76 28 20 15 7 26 44 9 83 61 77 100 69 65 89 70 71 72 98 19 43 99 10 11 53 60

Output: 33 0

5.  Input:
    7 15
    141 225 37 26 197 75 198 58 166 217 157 210 56 33 211
    53 77 133 152 128 90 94 192 8 1 138 174 125 65 184
    72 91 186 159 162 129 51 168 30 183 95 50 213 158 148
    83 179 11 12 62 150 22 67 131 120 86 45 40 214 88
    134 221 14 48 208 97 16 118 142 74 155 165 9 109 36
    60 59 10 161 190 103 170 194 202 99 167 64 32 110 146
    119 209 223 102 54 189 18 35 144 220 112 20 96 105 68
    113 69 224 172 42 101 73 61 28 215 216 188 191 139 13
    180 195 31 147 193 201 92 136 219 163 116 196 100 160 182
    46 156 199 81 25 3 117 104 4 121 205 2 173 200 44
    29 114 17 206 84 57 187 21 218 80 98 124 55 47 5
    154 87 49 27 145 108 203 63 212 176 126 115 19 111 15
    140 171 178 137 76 143 85 164 23 93 132 151 106 123 122
    185 78 34 181 39 130 6 24 222 66 153 38 41 82 7
    52 177 79 89 70 43 71 135 127 204 169 207 107 149 175
    144 182 30 163 98 71 90 106 5 126 22 120 93 180 81
    63 87 95 64 28 192 138 183 31 42 155 124 1 51 58
    189 223 142 215 55 149 168 143 7 61 35 218 145 13 70
    157 199 177 40 148 165 39 128 52 103 141 201 156 204 172
    111 184 175 59 206 86 26 187 132 4 224 23 193 74 190
    140 109 225 116 48 21 11 113 170 33 134 112 129 27 188
    36 38 44 78 105 150 72 91 167 6 200 84 136 56 125
    77 122 10 158 24 104 185 115 62 107 41 37 65 210 43
    66 67 101 222 82 217 198 131 100 152 161 173 96 3 220
    83 69 123 212 92 15 88 108 151 68 211 85 202 76 133
    45 216 191 127 54 186 169 178 34 153 12 8 135 121 147
    57 110 18 53 79 114 166 99 94 118 20 162 207 160 137
    203 119 17 213 221 174 219 80 47 2 60 32 179 97 208
    209 159 9 130 50 196 29 205 117 46 49 214 171 164 16
    75 102 195 154 25 73 197 176 139 14 181 19 89 146 194
    176 196 114 96 175 39 194 106 14 126 186 150 213 180 36
    212 78 66 57 143 62 26 69 169 181 116 70 79 214 209
    157 4 13 129 128 195 158 160 140 219 3 192 166 10 109
    19 32 38 207 172 18 27 221 80 200 198 147 146 104 138
    120 35 108 225 208 133 162 124 141 98 145 33 85 40 115
    7 53 168 201 37 184 203 61 164 71 68 135 113 105 48
    97 59 6 173 1 89 20 187 51 205 134 29 224 211 92
    139 178 220 23 179 60 188 182 90 58 170 102 110 91 99
    112 64 95 54 152 218 107 202 101 163 84 149 86 56 121
    12 123 197 119 127 63 144 87 49 191 118 21 185 154 83
    165 159 210 204 193 55 73 46 28 217 30 34 223 122 75
    16 2 100 117 136 77 43 161 167 142 42 131 216 47 174
    24 132 153 137 190 125 25 88 81 41 17 76 72 156 45
    94 22 15 52 111 93 189 44 8 177 9 103 183 206 199
    11 67 50 74 148 130 5 82 171 215 222 65 155 151 31
    213 108 61 159 63 160 18 4 214 178 207 130 179 139 117
    83 119 37 48 71 154 110 96 92 136 31 39 56 134 13
    2 85 171 27 19 88 172 205 195 206 24 6 162 94 12
    99 102 138 174 36 51 66 87 126 68 47 17 52 149 57
    40 45 46 211 81 141 89 111 113 49 210 93 140 167 170
    188 118 75 33 168 165 157 72 104 42 109 152 184 20 7
    106 14 1 67 60 128 28 79 26 218 183 38 186 133 189
    200 223 156 143 69 32 219 147 173 9 30 8 78 153 98
    59 115 80 212 70 90 190 166 146 151 225 182 103 16 163
    35 116 74 65 86 3 25 129 177 164 101 76 23 100 122
    105 175 121 95 180 224 53 187 64 155 148 145 124 158 15
    44 142 194 127 202 123 62 41 217 197 199 84 191 181 208
    120 22 215 209 222 21 161 203 125 131 198 10 201 55 192
    193 82 54 73 204 29 107 77 43 216 112 144 185 91 114
    196 221 50 34 5 11 97 58 135 176 169 220 132 137 150
    104 8 135 207 18 204 75 213 85 54 90 140 184 115 170
    45 171 17 6 110 132 117 58 205 219 187 180 165 73 161
    93 163 88 7 192 211 153 60 70 48 168 141 22 178 21
    62 203 221 199 27 19 67 55 61 145 154 24 30 97 159
    162 41 183 179 53 103 185 107 111 50 225 124 158 102 129
    59 32 65 156 1 81 177 218 3 174 120 11 200 176 112
    188 92 56 79 91 14 98 44 106 10 26 69 169 42 151
    214 39 74 99 150 12 148 164 4 208 223 216 190 68 146
    25 57 82 173 217 71 113 181 222 86 194 108 160 28 202
    186 66 152 34 51 43 128 52 76 84 35 5 175 83 182
    189 23 37 36 197 144 109 116 121 80 166 33 172 195 209
    122 126 40 134 157 139 94 131 123 143 47 155 114 95 167
    87 96 193 46 206 215 136 64 224 210 119 16 142 130 13
    2 198 77 15 72 78 127 138 63 191 118 49 149 38 201
    29 20 125 133 105 31 137 212 147 220 196 100 101 89 9
    86 189 95 141 224 120 214 171 140 77 212 67 222 58 156
    10 148 205 199 202 201 215 37 7 162 176 197 112 17 43
    74 14 61 52 173 87 59 89 44 22 218 12 138 117 81
    125 107 4 147 194 29 93 191 161 45 56 217 136 207 185
    6 96 3 79 135 11 66 163 70 91 42 164 116 46 144
    84 111 153 196 132 155 151 71 124 51 75 137 32 106 57
    50 55 85 160 82 154 187 186 26 157 60 179 211 122 198
    152 118 105 97 23 168 35 73 88 200 5 25 175 188 126
    110 180 127 114 101 209 72 123 102 90 150 24 68 128 113
    220 192 223 98 208 193 119 15 133 27 28 166 1 165 76
    18 38 204 62 130 174 213 16 195 139 108 225 31 69 131
    115 142 30 121 9 41 40 34 49 219 80 146 149 92 181
    158 94 167 203 145 103 53 2 159 48 83 47 36 216 109
    177 206 104 20 129 65 210 21 134 64 190 78 39 19 172
    8 182 54 169 99 100 13 221 178 184 143 183 170 63 33
    78 84 39 81 151 21 166 185 181 42 130 86 92 6 119
    178 89 137 163 56 135 63 192 215 194 91 180 76 177 57
    96 17 220 3 159 68 12 171 24 35 210 47 38 134 30
    16 73 123 97 79 34 48 15 199 60 116 139 198 142 128
    122 120 195 144 32 87 158 213 5 19 27 184 141 165 150
    146 77 66 201 102 4 88 197 188 118 162 43 196 75 148
    82 190 7 187 206 138 209 54 145 131 203 113 186 212 193
    121 49 25 214 72 65 67 111 225 172 152 221 110 23 33
    41 157 205 224 167 173 127 26 14 216 223 156 143 104 125
    161 211 29 189 105 222 31 11 140 183 179 28 100 160 176
    133 2 1 108 109 112 155 70 74 182 101 62 107 90 106
    114 126 103 10 20 149 202 51 129 94 85 93 55 44 154
    117 37 99 53 61 115 169 175 124 174 36 217 18 164 219
    80 218 132 204 69 147 45 200 208 8 83 98 46 59 22
    58 71 50 136 153 9 207 95 52 170 40 13 64 168 191
    207 220 59 135 2 225 29 181 219 109 131 10 118 30 23 159 78 28 46 13 102 76 17 194 152 106 121 177 222 27 202 21 47 77 153 37 149 16 182 68 38 57 141 210 188 178 187 165 193 19 122 99 104 134 73 44 209 224 203 35 80 55 198 52 88 144 101 81 126 58 64 197 155 39 36 183 103 15 161 85 18 96 125 14 171 127 169 89 128 40 218 215 214 213 142 216 212 107 60 105 138 146 34 31 123 71 100 108 162 147 82 65 20 150 179 167 172 93 63 208 72 4 117 79 129 164 137 217 32 6 7 56 184 190 8 191 70 87 180 221 133 205 154 86 11 91 157 158 145 186 120 94 170 111 140 75 33 53 200 168 206 26 119 199 25 3 160 110 61 1 192 95 113 12 90 112 223 166 173 41 51 201 148 48 175 124 204 185 45 22 156 5 83 116 84 42 136 74 174 151 143 67 54 130 69 115 98 49 211 50 43 114 92 196 132 195 176 139 9 24 62 163 189 66 97

    Output: 200 2
*/
